In [40]:
import pandas as pd

x = {'Name' : ['Rose','John','Mary','Jane'],
    'ID': [1,2,3,4],
    'Department': ['Architect Group', 'Software Group', 'Design Team', 'Infrastructure'],
    'Salary':[100000, 80000, 50000, 60000]}

df = pd.DataFrame(x)
df

   Name  ID       Department  Salary
0  Rose   1  Architect Group  100000
1  John   2   Software Group   80000
2  Mary   3      Design Team   50000
3  Jane   4   Infrastructure   60000

In [41]:
df['Name']

0    Rose
1    John
2    Mary
3    Jane
Name: Name, dtype: object

In [42]:
z = df[['Department','Salary']]
z

        Department  Salary
0  Architect Group  100000
1   Software Group   80000
2      Design Team   50000
3   Infrastructure   60000

In [43]:
import pandas as pd
x = {'Student' : ['David','Samuel','Terry','Evan'] ,
     'Age':['27','24','22','32'],
     'Country':['UK','Canada','China','USA'],
     'Course':['Python','DS','ML','Web Development'],'Marks':['85','72','89','76']}
df = pd.DataFrame(x)
type(df)
df

  Student Age Country           Course Marks
0   David  27      UK           Python    85
1  Samuel  24  Canada               DS    72
2   Terry  22   China               ML    89
3    Evan  32     USA  Web Development    76

In [44]:
b = df[['Marks']]
b

  Marks
0    85
1    72
2    89
3    76

In [45]:
c = df[['Country','Course']]
c

  Country           Course
0      UK           Python
1  Canada               DS
2   China               ML
3     USA  Web Development

In [46]:
df.iloc[0,0]

'David'

In [47]:
df.loc[3,'Course']

'Web Development'

In [48]:
df2.head()

df2.tail()

        Age Country           Course Marks
Student
David    27      UK           Python    85
Samuel   24  Canada               DS    72
Terry    22   China               ML    89
Evan     32     USA  Web Development    76

In [49]:
df2.iloc[2,2]

'ML'

In [50]:
df2.iloc[0:2, 0:2]

        Age Country
Student
David    27      UK
Samuel   24  Canada

In [54]:
df.loc[0:1 , "Age":"Course"]

  Age Country  Course
0  27      UK  Python
1  24  Canada      DS

In [55]:
pd.Series([1,3,4,5])

0    1
1    3
2    4
3    5
dtype: int64

In [10]:
pd.Series([30,40,50,80], index= ['a','b','c','d'])

a    30
b    40
c    50
d    80
dtype: int64

In [11]:
fruits = pd.DataFrame([[30 , 21]], columns = ['Apple','Bananas'], index = ['2017 Sales','2018 Sales'])
fruits

            Apple  Bananas
2017 Sales     30       21
2018 Sales     30       21

In [12]:
names = ['Flour','Milk','Eggs','Spam']
quantity = ['4 cups','1 cup','2 large','1 can']
ingredients = pd.Series(quantity, index = names, name = 'Dinner')
ingredients

Flour     4 cups
Milk       1 cup
Eggs     2 large
Spam       1 can
Name: Dinner, dtype: object

In [13]:
index_label = [1,2,3,5,8]
names = ['Flour','Milk','Eggs','Spam','rice']
items = pd.DataFrame(names, index_label)
items

       0
1  Flour
2   Milk
3   Eggs
5   Spam
8   rice

In [14]:
data = pd.read_csv(r"C:\Users\ranju\Downloads\Flavors.csv")
data

,Flavor,Base Flavor,Liked,Flavor Rating,Texture Rating,Total Rating
0,Mint Chocolate Chip,Vanilla,Yes,10.0,8.0,18.0
1,Chocolate,Chocolate,Yes,8.8,7.6,16.6
2,Vanilla,Vanilla,No,4.7,5.0,9.7
3,Cookie Dough,Vanilla,Yes,6.9,6.5,13.4
4,Rocky Road,Chocolate,Yes,8.2,7.0,15.2
5,Pistachio,Vanilla,No,2.3,3.4,5.7
6,Cake Batter,Vanilla,Yes,6.5,6.0,12.5
7,Neapolitan,Vanilla,No,3.8,5.0,8.8
8,Chocolte Fudge Brownie,Chocolate,Yes,8.2,7.1,15.3

In [15]:
data.groupby('Base Flavor').size()

Base Flavor
Chocolate    3
Vanilla      6
dtype: int64

In [18]:
data.describe()

       Flavor Rating  Texture Rating  Total Rating
count         9.0000        9.000000      9.000000
mean          6.6000        6.177778     12.800000
std           2.5387        1.478832      4.030509
min           2.3000        3.400000      5.700000
25%           4.7000        5.000000      9.700000
50%           6.9000        6.500000     13.400000
75%           8.2000        7.100000     15.300000
max          10.0000        8.000000     18.000000

In [31]:
data.groupby('Base Flavor').sum()

,Flavor,Liked,Flavor Rating,Texture Rating,Total Rating
Base Flavor,,,,,
Chocolate,ChocolateRocky RoadChocolte Fudge Brownie,YesYesYes,25.2,21.7,47.1
Vanilla,Mint Chocolate ChipVanillaCookie DoughPistachi...,YesNoYesNoYesNo,34.2,33.9,68.1

In [35]:
data.groupby(['Base Flavor','Liked']).agg({'Flavor Rating' : ['min','max','sum']})

                  Flavor Rating
                            min   max   sum
Base Flavor Liked
Chocolate   Yes             8.2   8.8  25.2
Vanilla     No              2.3   4.7  10.8
            Yes             6.5  10.0  23.4

In [33]:
data.groupby('Base Flavor').describe()

            Flavor Rating                                             \
                    count mean       std  min    25%  50%  75%   max
Base Flavor
Chocolate             3.0  8.4  0.346410  8.2  8.200  8.2  8.5   8.8
Vanilla               6.0  5.7  2.710719  2.3  4.025  5.6  6.8  10.0

            Texture Rating            ...             Total Rating         \
                     count      mean  ...    75%  max        count   mean
Base Flavor                           ...
Chocolate              3.0  7.233333  ...  7.350  7.6          3.0  15.70
Vanilla                6.0  5.650000  ...  6.375  8.0          6.0  11.35


                  std   min     25%   50%     75%   max
Base Flavor
Chocolate    0.781025  15.2  15.250  15.3  15.950  16.6
Vanilla      4.263684   5.7   9.025  11.1  13.175  18.0

[2 rows x 24 columns]